{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 66], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAFAAAAEwAAAHMQAAAAdABqAXwAiABkAWQCjQNTACkDTun/////KQLa\nEm51bV9vcl9zaXplX3NwbGl0c9oEYXhpcykC2gp0ZW5zb3JmbG932gVzcGxpdCkB2gF4KQHaCm5f\nY2hhbm5lbHOpAHoyQzovVXNlcnMvYXJ0aHUvUHljaGFybVByb2plY3RzL0hhbmRHZXN0dXJlL21h\naW4ucHnaCDxsYW1iZGE+IgAAAHMCAAAAEAA=\n", null, [66]], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d", "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_3", "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_6", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_6", "inbound_nodes": [[["lambda", 0, 1, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_9", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_9", "inbound_nodes": [[["lambda", 0, 1, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_12", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_12", "inbound_nodes": [[["lambda", 0, 2, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_15", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_15", "inbound_nodes": [[["lambda", 0, 2, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_18", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_18", "inbound_nodes": [[["lambda", 0, 3, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_21", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_21", "inbound_nodes": [[["lambda", 0, 3, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_24", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_24", "inbound_nodes": [[["lambda", 0, 4, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_27", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_27", "inbound_nodes": [[["lambda", 0, 4, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_30", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_30", "inbound_nodes": [[["lambda", 0, 5, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_33", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_33", "inbound_nodes": [[["lambda", 0, 5, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_36", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_36", "inbound_nodes": [[["lambda", 0, 6, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_39", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_39", "inbound_nodes": [[["lambda", 0, 6, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_42", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_42", "inbound_nodes": [[["lambda", 0, 7, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_45", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_45", "inbound_nodes": [[["lambda", 0, 7, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_48", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_48", "inbound_nodes": [[["lambda", 0, 8, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_51", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_51", "inbound_nodes": [[["lambda", 0, 8, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_54", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_54", "inbound_nodes": [[["lambda", 0, 9, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_57", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_57", "inbound_nodes": [[["lambda", 0, 9, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_60", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_60", "inbound_nodes": [[["lambda", 0, 10, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_63", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_63", "inbound_nodes": [[["lambda", 0, 10, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_66", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_66", "inbound_nodes": [[["lambda", 0, 11, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_69", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_69", "inbound_nodes": [[["lambda", 0, 11, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_72", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_72", "inbound_nodes": [[["lambda", 0, 12, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_75", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_75", "inbound_nodes": [[["lambda", 0, 12, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_78", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_78", "inbound_nodes": [[["lambda", 0, 13, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_81", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_81", "inbound_nodes": [[["lambda", 0, 13, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_84", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_84", "inbound_nodes": [[["lambda", 0, 14, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_87", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_87", "inbound_nodes": [[["lambda", 0, 14, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_90", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_90", "inbound_nodes": [[["lambda", 0, 15, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_93", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_93", "inbound_nodes": [[["lambda", 0, 15, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_96", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_96", "inbound_nodes": [[["lambda", 0, 16, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_99", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_99", "inbound_nodes": [[["lambda", 0, 16, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_102", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_102", "inbound_nodes": [[["lambda", 0, 17, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_105", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_105", "inbound_nodes": [[["lambda", 0, 17, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_108", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_108", "inbound_nodes": [[["lambda", 0, 18, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_111", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_111", "inbound_nodes": [[["lambda", 0, 18, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_114", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_114", "inbound_nodes": [[["lambda", 0, 19, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_117", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_117", "inbound_nodes": [[["lambda", 0, 19, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_120", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_120", "inbound_nodes": [[["lambda", 0, 20, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_123", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_123", "inbound_nodes": [[["lambda", 0, 20, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_126", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_126", "inbound_nodes": [[["lambda", 0, 21, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_129", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_129", "inbound_nodes": [[["lambda", 0, 21, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_132", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_132", "inbound_nodes": [[["lambda", 0, 22, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_135", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_135", "inbound_nodes": [[["lambda", 0, 22, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_138", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_138", "inbound_nodes": [[["lambda", 0, 23, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_141", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_141", "inbound_nodes": [[["lambda", 0, 23, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_144", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_144", "inbound_nodes": [[["lambda", 0, 24, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_147", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_147", "inbound_nodes": [[["lambda", 0, 24, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_150", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_150", "inbound_nodes": [[["lambda", 0, 25, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_153", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_153", "inbound_nodes": [[["lambda", 0, 25, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_156", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_156", "inbound_nodes": [[["lambda", 0, 26, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_159", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_159", "inbound_nodes": [[["lambda", 0, 26, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_162", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_162", "inbound_nodes": [[["lambda", 0, 27, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_165", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_165", "inbound_nodes": [[["lambda", 0, 27, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_168", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_168", "inbound_nodes": [[["lambda", 0, 28, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_171", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_171", "inbound_nodes": [[["lambda", 0, 28, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_174", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_174", "inbound_nodes": [[["lambda", 0, 29, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_177", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_177", "inbound_nodes": [[["lambda", 0, 29, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_180", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_180", "inbound_nodes": [[["lambda", 0, 30, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_183", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_183", "inbound_nodes": [[["lambda", 0, 30, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_186", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_186", "inbound_nodes": [[["lambda", 0, 31, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_189", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_189", "inbound_nodes": [[["lambda", 0, 31, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_192", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_192", "inbound_nodes": [[["lambda", 0, 32, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_195", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_195", "inbound_nodes": [[["lambda", 0, 32, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_198", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_198", "inbound_nodes": [[["lambda", 0, 33, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_201", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_201", "inbound_nodes": [[["lambda", 0, 33, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_204", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_204", "inbound_nodes": [[["lambda", 0, 34, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_207", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_207", "inbound_nodes": [[["lambda", 0, 34, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_210", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_210", "inbound_nodes": [[["lambda", 0, 35, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_213", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_213", "inbound_nodes": [[["lambda", 0, 35, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_216", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_216", "inbound_nodes": [[["lambda", 0, 36, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_219", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_219", "inbound_nodes": [[["lambda", 0, 36, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_222", "trainable": true, "batch_input_shape": [null, 100, 1], "dtype": "float32", "filters": 8, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_222", "inbound_nodes": [[["lambda", 0, 37, 